2 + 3
(3+6)*10

# 2의 제곱
2^2

# 나머지 연산자
 10 %% 3 #몫 : 3, 나머지 : 1

# 함수 사용
log(10) + 5 #로그함수
sqrt(-5)
sqrt(100)   #제곱근
max(10, 5, 7, -8, 1000) #최대값 구함
min(10, 5, 7, -8, 1000) #최소값 구함

# 변수(variable) - 얼마든지 변할수 있는 값
a <- 10 # a변수에다가 10을 저장함.
a
#  <-의 단축키 : alt + -

b <- 20
b
c <- a + b
c
print(c)

a <- "a"
a
a + b  #문자 + 숫자는 연산이 안됨.

b <- "b"
a + b #문자 + 문자는 연산이 안됨.

# 논리형 (TRUE, FALSE)

c <- TRUE
c <- F

# NULL은 아무런 값을 지니지 않는다.

d <- NULL
d

# NaN값을 출력
sqrt(-10)

# NA --> 결측치, 누락된 값











